using System;
using System.IO;
using Xamarin.Forms;
using Xamarin.Forms.Xaml;
using Xamarin.Forms.PlatformConfiguration.AndroidSpecific;

namespace GibDD
{
    public partial class App : Xamarin.Forms.Application
    {
        public static string Regdata { get; set; }
        public const string DATABASE_NAME = "database.db";
        public static Repository database;
        public static Repository Database
        {
            get
            {
                if (database == null)
                {
                    database = new Repository(
                        Path.Combine(
                            Environment.GetFolderPath(Environment.SpecialFolder.LocalApplicationData), DATABASE_NAME));
                }
                return database;
            }
        }
        public App()
        {
            Regdata = "{\"name\":{\"01\":\"Респ Адыгея\",\"02\":\"Респ Башкортостан\",\"03\":\"Респ Бурятия\",\"04\":\"Респ Алтай\",\"05\":\"Респ Дагестан\",\"06\":\"Респ Ингушетия\",\"07\":\"Респ Кабардино-Балкарская\",\"08\":\"Респ Калмыкия\",\"09\":\"Респ Карачаево-Черкесская\",\"10\":\"Респ Карелия\",\"11\":\"Респ Коми\",\"12\":\"Респ Марий Эл\",\"13\":\"Респ Мордовия\",\"14\":\"Респ Саха / Якутия\",\"15\":\"Респ Северная Осетия - Алания\",\"16\":\"Респ Татарстан\",\"17\":\"Респ Тыва\",\"18\":\"Респ Удмуртская\",\"19\":\"Респ Хакасия\",\"20\":\"Респ Чеченская\",\"21\":\"Чувашская Республика - Чувашия\",\"22\":\"Алтайский край\",\"23\":\"Краснодарский край\",\"24\":\"Красноярский край\",\"25\":\"Приморский край\",\"26\":\"Ставропольский край\",\"27\":\"Хабаровский край\",\"28\":\"Амурская обл\",\"29\":\"Архангельская обл\",\"30\":\"Астраханская обл\",\"31\":\"Белгородская обл\",\"32\":\"Брянская обл\",\"33\":\"Владимирская обл\",\"34\":\"Волгоградская обл\",\"35\":\"Вологодская обл\",\"36\":\"Воронежская обл\",\"37\":\"Ивановская обл\",\"38\":\"Иркутская обл\",\"39\":\"Калининградская обл\",\"40\":\"Калужская обл\",\"41\":\"Камчатский край\",\"42\":\"Кемеровская область - Кузбасс\",\"43\":\"Кировская обл\",\"44\":\"Костромская обл\",\"45\":\"Курганская обл\",\"46\":\"Курская обл\",\"47\":\"Ленинградская обл\",\"48\":\"Липецкая обл\",\"49\":\"Магаданская обл\",\"50\":\"Московская обл\",\"51\":\"Мурманская обл\",\"52\":\"Нижегородская обл\",\"53\":\"Новгородская обл\",\"54\":\"Новосибирская обл\",\"55\":\"Омская обл\",\"56\":\"Оренбургская обл\",\"57\":\"Орловская обл\",\"58\":\"Пензенская обл\",\"59\":\"Пермский край\",\"60\":\"Псковская обл\",\"61\":\"Ростовская обл\",\"62\":\"Рязанская обл\",\"63\":\"Самарская обл\",\"64\":\"Саратовская обл\",\"65\":\"Сахалинская обл\",\"66\":\"Свердловская обл\",\"67\":\"Смоленская обл\",\"68\":\"Тамбовская обл\",\"69\":\"Тверская обл\",\"70\":\"Томская обл\",\"71\":\"Тульская обл\",\"72\":\"Тюменская обл\",\"73\":\"Ульяновская обл\",\"74\":\"Челябинская обл\",\"75\":\"Забайкальский край\",\"76\":\"Ярославская обл\",\"77\":\"г Москва\",\"78\":\"г Санкт-Петербург\",\"79\":\"Еврейская Аобл\",\"83\":\"Ненецкий АО\",\"86\":\"Ханты-Мансийский Автономный округ - Югра\",\"87\":\"Чукотский АО\",\"89\":\"Ямало-Ненецкий АО\",\"91\":\"Респ Крым\",\"92\":\"г Севастополь\",\"99\":\"г Байконур\"}}";
            Xamarin.Forms.Application.Current.On<Xamarin.Forms.PlatformConfiguration.Android>().UseWindowSoftInputModeAdjust(WindowSoftInputModeAdjust.Resize);
            InitializeComponent();

            MainPage = new NavigationPage(new MainPage());
        }

        protected override void OnStart()
        {
        }

        protected override void OnSleep()
        {
        }

        protected override void OnResume()
        {
        }
    }
}
